import pandas as pd
import numpy as np



####################################
# DataFram 相当于将一维的 Series 组合成一个二维的表格
# 默认索引



# 自定义索引


####################################
# 通过索引获取数据
# 获得一列


# 同时获得多列


# 同时限制行和列索引


# X 不能这样获取多列，因为多列也是DataFrame，后面的索引依然获取列


# 通过 ix、loc、iloc、values 获得行索引,
# ix


# loc
# 注意：loc 不能通过数字下标获取行


# iloc
# 注意：iloc 不能通过 文字 下标获取行



# 同时获得多行



# 同时多行多列


# 获得一点的值


# values



###########################################
# DataFrame 之间的运算
# 相同维度运算



# 不同维度运算



############################################
# 合并


# 上下拼接


# 拼接可以超过2个


# 左右拼接



# 重建索引



# 拼接时加上二层索引



############################################
# 多层索引


############################################
# stack 和 unstack ，实现行列转换，参数 level
# stack，调整 cloumn


# unstack，调整 index



############################################
# 聚合操作



############################################
# 从 CSV 文件录入数据



# 指定某列作为索引：index_col



############################################
# merge，join
# 不指定字段，则自动关联名字一样的



# 若字段名不一样，可以指定字段



# join 和 concat 一样，用索引关联
# 注意：lsuffix，rsuffix 参数要写上



############################################
# 数据去重


############################################
# 新增一列


############################################
# 删除一列


############################################
# 筛选


############################################
# 分组：group by



############################################
# 排序，降序时使用 ascending


###########################################
# 获得 columns 和 index 信息



