import pandas as pd
import numpy as np



####################################
# Series 相当于有索引的一维数组，类似于Python的字典
# 通过列表创建



# 通过 numpy数组 创建


# 指定索引


# 注意，索引数量和数组元素个数应该一致


# 通过Python字典创建，指定索引


# 通过索引获得或改变值，这点和字典如出一致



# 拷贝


####################################
# Series 的值，不只是数字，可以是多种多样




####################################
# 切片



####################################
# 筛选



####################################
# 空值处理，自动转换成 nan



####################################
# 与单个数字进行运算



# 序列间运算



# 序列间运算，用户 0 替换 nan



# 序列多层索引



